
## :white_check_mark: Apply Succeeded (dev)

[CI link](https://github.com/a-company-jp/lgtm-tf/actions/runs/8672192842)



<pre><code>Apply complete! Resources: 2 added, 1 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
google_project_service.vision_api: Refreshing state... [id=lgtmgen-project/vision.googleapis.com]
data.google_iam_policy.noauth: Reading...
google_project_service.firestore_api: Refreshing state... [id=lgtmgen-project/firestore.googleapis.com]
google_artifact_registry_repository.main-repo: Refreshing state... [id=projects/lgtmgen-project/locations/asia-northeast1/repositories/dev-main]
data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_firestore_database.datastore_mode_database: Refreshing state... [id=projects/lgtmgen-project/databases/(default)]
google_cloud_run_service.cloudrun-dev-main-backend: Refreshing state... [id=locations/asia-northeast1/namespaces/lgtmgen-project/services/dev-main-backend]
google_storage_bucket.public_image_bucket: Refreshing state... [id=lgtm-public-image-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_service.cloudrun-dev-main-backend is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "cloudrun-dev-main-backend" {
      ~ id                         = "locations/asia-northeast1/namespaces/lgtmgen-project/services/dev-main-backend" -> (known after apply)
        name                       = "dev-main-backend"
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = <<-EOT
                            Revision 'dev-main-backend-00001-fvv' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable. Logs for this revision might contain more information.
                            
                            Logs URL: https://console.cloud.google.com/logs/viewer?project=lgtmgen-project&resource=cloud_run_revision/service_name/dev-main-backend/revision_name/dev-main-backend-00001-fvv&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22dev-main-backend%22%0Aresource.labels.revision_name%3D%22dev-main-backend-00001-fvv%22 
                            For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
                      - reason  = "HealthCheckContainerError"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                        # (2 unchanged attributes hidden)
                    },
                  - {
                      - message = <<-EOT
                            Revision 'dev-main-backend-00001-fvv' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable. Logs for this revision might contain more information.
                            
                            Logs URL: https://console.cloud.google.com/logs/viewer?project=lgtmgen-project&resource=cloud_run_revision/service_name/dev-main-backend/revision_name/dev-main-backend-00001-fvv&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22dev-main-backend%22%0Aresource.labels.revision_name%3D%22dev-main-backend-00001-fvv%22 
                            For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
                      - reason  = "HealthCheckContainerError"
                      - status  = "False"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "dev-main-backend-00001-fvv"
              - latest_ready_revision_name   = "dev-main-backend-00001-fvv"
              - observed_generation          = 1
              - traffic                      = []
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      - metadata {
          - annotations           = {} -> null
          - effective_annotations = {
              - "run.googleapis.com/ingress"        = "all"
              - "run.googleapis.com/ingress-status" = "all"
              - "run.googleapis.com/operation-id"   = "e380b374-40f7-4565-96bb-97a57b7f01b4"
              - "serving.knative.dev/creator"       = "gh-actions@lgtmgen-project.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier"  = "gh-actions@lgtmgen-project.iam.gserviceaccount.com"
            } -> null
          - effective_labels      = {
              - "cloud.googleapis.com/location" = "asia-northeast1"
            } -> null
          - generation            = 1 -> null
          - labels                = {} -> null
          - namespace             = "lgtmgen-project" -> null
          - resource_version      = "AAYV9yAfXto" -> null
          - self_link             = "/apis/serving.knative.dev/v1/namespaces/228944830644/services/dev-main-backend" -> null
          - terraform_labels      = {} -> null
          - uid                   = "a70fdfed-b962-44c5-a8b6-e0bbce38a285" -> null
        }

      ~ template {
          - metadata {
              - annotations      = {
                  - "autoscaling.knative.dev/maxScale" = "100"
                } -> null
              - generation       = 0 -> null
              - labels           = {
                  - "run.googleapis.com/startupProbeType" = "Default"
                } -> null
                name             = null
                # (4 unchanged attributes hidden)
            }
          ~ spec {
              ~ container_concurrency = 80 -> (known after apply)
              ~ service_account_name  = "228944830644-compute@developer.gserviceaccount.com" -> (known after apply)
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)

              ~ containers {
                  - args        = [] -> null
                  - command     = [] -> null
                  + name        = (known after apply)
                    # (2 unchanged attributes hidden)

                  - ports {
                      - container_port = 8080 -> null
                      - name           = "http1" -> null
                        # (1 unchanged attribute hidden)
                    }

                  - resources {
                      - limits   = {
                          - "cpu"    = "1000m"
                          - "memory" = "512Mi"
                        } -> null
                      - requests = {} -> null
                    }

                  - startup_probe {
                      - failure_threshold     = 1 -> null
                      - initial_delay_seconds = 0 -> null
                      - period_seconds        = 240 -> null
                      - timeout_seconds       = 240 -> null

                      - tcp_socket {
                          - port = 8080 -> null
                        }
                    }
                }
            }
        }

      ~ traffic {
          + url             = (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # google_cloud_run_service_iam_policy.noauth will be created
  + resource "google_cloud_run_service_iam_policy" "noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "asia-northeast1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "lgtmgen-project"
      + service     = "dev-main-backend"
    }

  # google_storage_bucket.public_image_bucket will be updated in-place
  ~ resource "google_storage_bucket" "public_image_bucket" {
        id                          = "lgtm-public-image-bucket"
        name                        = "lgtm-public-image-bucket"
        # (14 unchanged attributes hidden)

      ~ cors {
          ~ origin          = [
              + null,
            ]
            # (3 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.
google_cloud_run_service.cloudrun-dev-main-backend: Destroying... [id=locations/asia-northeast1/namespaces/lgtmgen-project/services/dev-main-backend]
google_storage_bucket.public_image_bucket: Modifying... [id=lgtm-public-image-bucket]
google_storage_bucket.public_image_bucket: Modifications complete after 2s [id=lgtm-public-image-bucket]
google_cloud_run_service.cloudrun-dev-main-backend: Destruction complete after 2s
google_cloud_run_service.cloudrun-dev-main-backend: Creating...
google_cloud_run_service.cloudrun-dev-main-backend: Still creating... [10s elapsed]
google_cloud_run_service.cloudrun-dev-main-backend: Creation complete after 19s [id=locations/asia-northeast1/namespaces/lgtmgen-project/services/dev-main-backend]
google_cloud_run_service_iam_policy.noauth: Creating...
google_cloud_run_service_iam_policy.noauth: Creation complete after 1s [id=v1/projects/lgtmgen-project/locations/asia-northeast1/services/dev-main-backend]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 1 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"run-terraform-apply","PRNumber":11,"Program":"tfcmt","SHA1":"29aa75cfdc1ad372fb680f362e78c4a2b8b2ace5","Target":"dev","Vars":{},"WorkflowName":"Run Terragrunt Apply on main branch push"} -->